{
  "Rooms": [
    {
      "Id": "start",
      "AutoGo": "меню"
    },
    {
      "Id": "меню",
      "List": "Привет, давай пофантазируем! Заходим в любое заведение. На стене висит QR код или просто написано @VariatorService. Ты наливаешь себе кофе, садишься на диванчик и запускаешь бота...",
      "Items": [
        {
          "Button": "Cписок услуг",
          "Go": "услуги"
        },
        {
          "Button": "Наши Акции",
          "Go": "акции"
        },
        {
          "Button": "Что такое вариатор",
          "Go": "чтоТакоеВариатор"
        },
        {
          "Button": "Показать бота",
          "Go": "бот"
        },
        {
          "Button": "Боты прикольно...",
          "Go": "прикольно"
        },
        {
          "Button": "Я жду машину",
          "Go": "ждуМашину"
        }
      ]
    },
    {
      "Id": "услуги",
      "List": "Наши услуги",
      "Items": [
        {
          "Button": "Направить вариатор - (от 100 т.р.)",
          "Go": "вариатор"
        },
        {
          "Button": "Рассказать анекдот - (от 10 р.)",
          "Go": "анекдот"
        }
      ]
    },
    {
      "Id": "акции",
      "List": "Наши акции",
      "Items": [
        {
          "Button": "Пять первых посетителей получат скидку 20%",
          "Go": "скидка20"
        }
      ]
    },
    {
      "Id": "бот",
      "Do": "SendConfig",
      "AutoGo": "меню"
    },
    {
      "Id": "прикольно",
      "Ask": "Хотите своего бота?",
      "YesGo": "хочуБота",
      "NoGo": "неХочуБота"
    },
    {
      "Id": "хочуБота",
      "Say": "Нужно просто поправить конфиг и прислать мне. В меню есть кнопка 'Показать бота'",
      "Go": "меню"
    },
    {
      "Id": "неХочуБота",
      "Say": "Спасибо за Ваше внимание! Нам кажется, что однажды Вы нас захотитет...",
      "Go": "меню"
    },
    {
      "Id": "скидка20",
      "Say": "Тут мы сходим в нашу базу данных, проверим, что вы у нас возможно... 4й клиент и сделаем вам скидку!",
      "Go": "меню"
    },
    {
      "Id": "вариатор",
      "Ask": "Записать вас к мастеру на определенное время?",
      "YesGo": "записать",
      "NoGo": "меню"
    },
    {
      "Id": "записать",
      "Say": "Тут мы сходим в нашу базу данных, найдем свободное время. Предложим вам список, где вы сами можете выбрать удобное время, когда подъехать",
      "Go": "меню"
    },
    {
      "Id": "анекдот",
      "Say": "Сидит на берегу реки ежик и косяк забивает. Подходит к нему бобер и говорит: Ежик, ты чего делаешь? Е: Косяк забиваю. Б: А мне затянуться дашь? Е: Да ты же не умеешь. Б: А ты меня научи. Е: Короче, сейчас затягиваешься, и ныряешь, а на другом берегу выдохнешь и кайф поймаешь, понял? Бобер думает, чего же тут не понятного, затягивается и ныряет. Выныривает, выдыхает и лежит, кайфует. Идет мимо бегемот, и спрашивает у бобра, чего это он такой счастливый лежит? А бобер ему и говорит: Там на том берегу ежик затянуться дает, если хочешь кайф словить, плыви к нему. Ну, Бегемот ныряет и выныривает на другом берегу прямо перед ежиком. Ежик посмотрел на него (квадратными глазами) и как заорет: Бобёр!!! Выдыхай!!! Выдыхай!!!",
      "Go": "меню"
    },
    {
      "Id": "ждуМашину",
      "Ask": "Вам кажется, что слишком долго?",
      "YesGo": "даДолго",
      "NoGo": "нетНеДолго",
      "Say": "Как только ваши машина будет готова, я вам сообщу. А пока бар, телевизор, развлечения к вашим услугам!",
      "Go": "меню"
    },
    {
      "Id": "даДолго",
      "Say": "Мастер не торопится, старается качественно направить вариатор. Потерпите еще немного",
      "Go": "меню"
    },
    {
      "Id": "нетНеДолго",
      "Say": "Спасибо за Ваше понимание. Вы наш любимый клиент!",
      "Go": "меню"
    },
    {
      "Id": "чтоТакоеВариатор",
      "Say": "Главное отличие от других коробок передач, заключающееся в плавном изменении крутящего момента в заданном диапазоне регулирования. В других типах трансмиссий используются ступенчатые преобразования, происходящие при разрыве потока мощности, что отрицательно влияет на равномерность движения транспортного средства",
      "Go": "меню"
    }
  ]
}